app/controllers/flights_controller.rb

  def create
    params[:flight][:passenger] = Person.where([ "first_name || ' ' || COALESCE(middle_name || ' ','') || " +
                                                    'last_name ILIKE ?', params[:flight][:passenger_name] ] ).first
    params[:flight][:distance] = params[:flight][:distance].to_f * 1000.0;

    if params[:flight][:flight_tags_attributes]
      params[:flight][:flight_tags_attributes].delete_if { |k,v| v[:status].empty? }
    end

    Flarc::Flight.transaction do
      @flight = Flarc::Flight.new

      igc_tmp_file = IgcTmpFile.find(params[:igc_tmp_file][:id])

      igc_file = IgcFile.open(igc_tmp_file.filename, 'rb')
      igc_file.read_contents {}
      @flight.update_from_igcfile(igc_file, igc_tmp_file.original_filename)

      @flight.update_attributes(params[:flight])

      respond_to do |format|
# FIXME disabled validations because of rails3 bug
        if @flight.save(false)
---
INSERT INTO "flights" ("passenger_id", "plane_id", "landing_time", "created_at", "updated_at", "pilot_id", "takeoff_time", "distance") VALUES(NULL, NULL, NULL, '2008-11-26 15:32:44.508791', '2008-11-26 15:32:44.508791', NULL, NULL, NULL) RETURNING "id"